dotfiles/doom/config.org
* DOOM THEME
Setting the theme to doom-one.  To try out new themes, I set a keybinding for
counsel-load-theme with 'SPC h t'.

#+begin_src emacs-lisp :tangle ./config.el
(use-package! base16-stylix-theme
  :ensure nil  ;; Ensures it won't be installed if missing
  :config
  (setq doom-theme 'base16-stylix))

;; Check if base16-stylix-theme is available, otherwise fallback to doom-opera-light
(setq doom-theme (if (featurep 'base16-stylix-theme)
                     'base16-stylix
                   'doom-opera-light))
#+end_src

* EMMS
One of the media players available for Emacs is emms, which stands for Emacs
Multimedia System.  By default, Doom Emacs does not use 'SPC m p d',' so the format
I use for these bindings is 'SPC a' plus 'key'.

| COMMAND               | DESCRIPTION                     | KEYBINDING |
|-----------------------+---------------------------------+------------|
| emms-playlist-mode-go | /Switch to the playlist buffer/   | SPC a a    |
| emms-pause            | /Pause the track/                 | SPC a x    |
| emms-stop             | /Stop the track/                  | SPC a s    |
| emms-previous         | /Play previous track in playlist/ | SPC a p    |
| emms-next             | /Play next track in playlist/     | SPC a n    |

#+begin_src emacs-lisp :tangle ./config.el
;; (emms-all)
;; (emms-default-players)
;; (emms-mode-line 1)
;; (emms-playing-time 1)
;; (setq emms-source-file-default-directory "~/Music/"
;;       emms-playlist-buffer-name "*Music*"
;;       emms-info-asynchronously t
;;       emms-source-file-directory-tree-function 'emms-source-file-directory-tree-find)
;; (map! :leader
;;       (:prefix ("m p d". "EMMS audio player")
;;        :desc "Go to emms playlist" "a" #'emms-playlist-mode-go
;;        :desc "Emms pause track" "x" #'emms-pause
;;        :desc "Emms stop track" "s" #'emms-stop
;;        :desc "Emms play previous track" "p" #'emms-previous
;;        :desc "Emms play next track" "n" #'emms-next))
#+end_src

* EVALUATE ELISP EXPRESSIONS
Changing some keybindings from their defaults to better fit with Doom Emacs, and
to avoid conflicts with my window managers which sometimes use the control key
in their keybindings.  By default, Doom Emacs does not use 'SPC e' for anything,
so I choose to use the format 'SPC e' plus 'key' for these (I also use 'SPC e'
for 'eww' keybindings).

| COMMAND         | DESCRIPTION                                  | KEYBINDING |
|-----------------+----------------------------------------------+------------|
| eval-buffer     | /Evaluate elisp in buffer/                     | SPC e b    |
| eval-defun      | /Evaluate the defun containing or after point/ | SPC e d    |
| eval-expression | /Evaluate an elisp expression/                 | SPC e e    |
| eval-last-sexp  | /Evaluate elisp expression before point/       | SPC e l    |
| eval-region     | /Evaluate elisp in region/                     | SPC e r    |

#+begin_src emacs-lisp :tangle ./config.el
(map! :leader
      (:prefix ("e". "evaluate/EWW")
       :desc "Evaluate elisp in buffer" "b" #'eval-buffer
       :desc "Evaluate defun" "d" #'eval-defun
       :desc "Evaluate elisp expression" "e" #'eval-expression
       :desc "Evaluate last sexpression" "l" #'eval-last-sexp
       :desc "Evaluate elisp in region" "r" #'eval-region))
#+end_src

* EWW
This is the Emacs Web Wowser, the builtin browser in Emacs.  Below I set urls to
open in a specific browser (eww) with browse-url-browser-function.  By default,
Doom Emacs does not use 'SPC e' for anything, so I choose to use the format 'SPC
e' plus 'key' for these (I also use 'SPC e' for 'eval' keybindings).  I chose to
use 'SPC s w' for eww-search-words because Doom Emacs uses 'SPC s' for 'search'
commands.

#+begin_src emacs-lisp :tangle ./config.el
;; (setq browse-url-browser-function 'eww-browse-url)
(map! :leader
      :desc "Search web for text between BEG/END"
      "s w" #'eww-search-words
      (:prefix ("e" . "evaluate/EWW")
       :desc "Eww web browser" "w" #'eww
       :desc "Eww reload page" "R" #'eww-reload))
#+end_src

* FONTS
Settings related to fonts within Doom Emacs:
+ 'doom-font' -- standard monospace font that defaults for most things in Emacs.
+ 'doom-variable-pitch-font' -- variable font which is useful in some Emacs
  plugins.
+ 'doom-big-font' -- used in doom-big-font-mode; useful for presentations.
+ 'font-lock-comment-face' -- for comments.
+ 'font-lock-keyword-face' -- for keywords with special significance like 'setq'
  in elisp.

#+begin_src emacs-lisp :tangle ./config.el
(setq doom-unicode-font "Symbola")
(setq doom-font (font-spec :family "ComicShannsMono Nerd Font Mono" :size 18)
      doom-variable-pitch-font (font-spec :family "ComicShannsMono Nerd Font Mono" :size 18)
      doom-big-font (font-spec :family "ComicShannsMono Nerd Font Mono" :size 22))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(bold :weight ultra-bold)
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src

* FUNCTIONS
These are a collection of functions which I've snipped from multiple sources on
the internet.  Some are slightly modified for my preferences, but overall I'm
not good enough with LISP to write my own functions yet.

** Insert date
Some custom functions to insert the date.  The function 'insert-todays-date' has
three different formats:

1) Just the keybinding without the universal argument prefix.
2) With one universal argument prefix.
3) With two universal argument prefixes.

The universal argument prefix is 'SPC-u' in Doom Emacs (C-u in standard GNU
Emacs).  The function 'insert-any-date' only outputs to one format, which is the
same format as 'insert-todays-date' without a prefix.

| COMMAND               | EXAMPLE OUTPUT            | KEYBINDING            |
|-----------------------+---------------------------+-----------------------|
| dt/insert-todays-date | 2021-11-19                | SPC i d t             |
| dt/insert-todays-date | Friday, November 19, 2021 | SPC u SPC i d t       |
| dt/insert-any-date    | Friday, November 19, 2021 | SPC i d a             |

=NOTE= Made by DT

#+begin_src emacs-lisp :tangle ./config.el
(defun func/insert-todays-date (prefix)
  (interactive "P")
  (let ((format (cond
                 ((not prefix) "%Y-%m-%d")
                 ((equal prefix '(4)) "%A, %B %d, %Y"))))
    (insert (format-time-string format))))

(require 'calendar)
(defun func/insert-any-date (date)
  "Insert DATE using the current locale."
  (interactive (list (calendar-read-date)))
  (insert (calendar-date-string date)))

(map! :leader
      (:prefix ("i d" . "Insert date")
        :desc "Insert any date" "a" #'func/insert-any-date
        :desc "Insert todays date" "t" #'func/insert-todays-date))
#+end_src

** Capture a task directly into a specific project
One important thing to point out here is that we're using 'file + head + olp' in
the capture template so that we can drop the new task entry under the "Tasks"
heading.

Works, but I'm unsure how to use it on my workflow, may be safe to delete it
later.

=NOTE= made by SystemCrafters

#+begin_src emacs-lisp :tangle ./config.el
(defun func/org-roam-capture-task ()
  (interactive)
  ;; Capture the new task, creating the project file if necessary
  (org-roam-capture-
   :node (org-roam-node-read nil)
   :templates '(("p" "project" plain "** TODO %?"
                 :if-new (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
                                        "#+title: ${title}\n#+category: ${title}\n#+filetags: Project"
                                        ("Tasks"))))))

(global-set-key (kbd "C-c n t") #'my/org-roam-capture-task)
#+end_src

* FLYCHECK
Configurations to add linting support to specific languages by integrating linters with flycheck.

#+begin_src emacs-lisp :tangle ./config.el
(use-package! flycheck
  :config
  (flycheck-define-checker nix-statix
    "A syntax checker for Nix using Statix."
    :command ("statix" "check" source)
    :error-patterns
    ((warning line-start (file-name) ":" line ":" column
              ": " (message) line-end))
    :modes (nix-mode))

  (add-to-list 'flycheck-checkers 'nix-statix))
#+end_src
* HUGO
Capture template for new hugo posts.

#+begin_src emacs-lisp :tangle ./config.el
;; Populates only the EXPORT_FILE_NAME property in the inserted headline.
(with-eval-after-load 'org-capture
  (defun org-hugo-new-subtree-post-capture-template ()
    "Returns `org-capture' template string for new Hugo post.
  See `org-capture-templates' for more information."
    (let* ((title (read-from-minibuffer "Post Title: ")) ;Prompt to enter the post title
           (fname (org-hugo-slug title)))
      (mapconcat #'identity
                 `(
                   ,(concat "* TODO " title)
                   ":PROPERTIES:"
                   ,(concat ":EXPORT_FILE_NAME: " (format-time-string "%Y-%m-%d-") fname)
                   ":END:"
                   "%?\n") ;Place the cursor here finally
                 "\n"))))
;; org capture templates
(setq org-capture-templates
      '(
        ("h" ;`org-capture' binding + h
         "Hugo post"
         entry
         ;; It is assumed that below file is present in `org-directory'
         ;; and that it has a "Blog Ideas" heading. It can even be a
         ;; symlink pointing to the actual location of all-posts.org!
         (file+olp "/home/jawz/Development/Websites/portfolio/content-org/posts.org" "blog")
         (function org-hugo-new-subtree-post-capture-template))
        ))
#+end_src

