dotfiles/doom/config.el

(use-package! base16-stylix-theme)
(require 'base16-stylix-theme)
(setq doom-theme 'base16-stylix)
;; (setq doom-theme 'doom-opera-light)
;; ;; (setq doom-theme 'doom-dark+)
;; (map! :leader
;;       :desc "Load new theme" "h t" #'counsel-load-theme)

;; (emms-all)
;; (emms-default-players)
;; (emms-mode-line 1)
;; (emms-playing-time 1)
;; (setq emms-source-file-default-directory "~/Music/"
;;       emms-playlist-buffer-name "*Music*"
;;       emms-info-asynchronously t
;;       emms-source-file-directory-tree-function 'emms-source-file-directory-tree-find)
;; (map! :leader
;;       (:prefix ("m p d". "EMMS audio player")
;;        :desc "Go to emms playlist" "a" #'emms-playlist-mode-go
;;        :desc "Emms pause track" "x" #'emms-pause
;;        :desc "Emms stop track" "s" #'emms-stop
;;        :desc "Emms play previous track" "p" #'emms-previous
;;        :desc "Emms play next track" "n" #'emms-next))

(map! :leader
      (:prefix ("e". "evaluate/EWW")
       :desc "Evaluate elisp in buffer" "b" #'eval-buffer
       :desc "Evaluate defun" "d" #'eval-defun
       :desc "Evaluate elisp expression" "e" #'eval-expression
       :desc "Evaluate last sexpression" "l" #'eval-last-sexp
       :desc "Evaluate elisp in region" "r" #'eval-region))

;; (setq browse-url-browser-function 'eww-browse-url)
(map! :leader
      :desc "Search web for text between BEG/END"
      "s w" #'eww-search-words
      (:prefix ("e" . "evaluate/EWW")
       :desc "Eww web browser" "w" #'eww
       :desc "Eww reload page" "R" #'eww-reload))

(setq doom-unicode-font "Symbola")
(setq doom-font (font-spec :family "ComicShannsMono Nerd Font Mono" :size 18)
      doom-variable-pitch-font (font-spec :family "ComicShannsMono Nerd Font Mono" :size 18)
      doom-big-font (font-spec :family "ComicShannsMono Nerd Font Mono" :size 22))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(bold :weight ultra-bold)
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))

(defun func/insert-todays-date (prefix)
  (interactive "P")
  (let ((format (cond
                 ((not prefix) "%Y-%m-%d")
                 ((equal prefix '(4)) "%A, %B %d, %Y"))))
    (insert (format-time-string format))))

(require 'calendar)
(defun func/insert-any-date (date)
  "Insert DATE using the current locale."
  (interactive (list (calendar-read-date)))
  (insert (calendar-date-string date)))

(map! :leader
      (:prefix ("i d" . "Insert date")
        :desc "Insert any date" "a" #'func/insert-any-date
        :desc "Insert todays date" "t" #'func/insert-todays-date))

(defun func/org-roam-capture-task ()
  (interactive)
  ;; Capture the new task, creating the project file if necessary
  (org-roam-capture-
   :node (org-roam-node-read nil)
   :templates '(("p" "project" plain "** TODO %?"
                 :if-new (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
                                        "#+title: ${title}\n#+category: ${title}\n#+filetags: Project"
                                        ("Tasks"))))))

(global-set-key (kbd "C-c n t") #'my/org-roam-capture-task)

(use-package! flycheck
  :config
  (flycheck-define-checker nix-statix
    "A syntax checker for Nix using Statix."
    :command ("statix" "check" source)
    :error-patterns
    ((warning line-start (file-name) ":" line ":" column
              ": " (message) line-end))
    :modes (nix-mode))

  (add-to-list 'flycheck-checkers 'nix-statix))

;; Populates only the EXPORT_FILE_NAME property in the inserted headline.
(with-eval-after-load 'org-capture
  (defun org-hugo-new-subtree-post-capture-template ()
    "Returns `org-capture' template string for new Hugo post.
  See `org-capture-templates' for more information."
    (let* ((title (read-from-minibuffer "Post Title: ")) ;Prompt to enter the post title
           (fname (org-hugo-slug title)))
      (mapconcat #'identity
                 `(
                   ,(concat "* TODO " title)
                   ":PROPERTIES:"
                   ,(concat ":EXPORT_FILE_NAME: " (format-time-string "%Y-%m-%d-") fname)
                   ":END:"
                   "%?\n") ;Place the cursor here finally
                 "\n"))))
;; org capture templates
(setq org-capture-templates
      '(
        ("h" ;`org-capture' binding + h
         "Hugo post"
         entry
         ;; It is assumed that below file is present in `org-directory'
         ;; and that it has a "Blog Ideas" heading. It can even be a
         ;; symlink pointing to the actual location of all-posts.org!
         (file+olp "/home/jawz/Development/Websites/portfolio/content-org/posts.org" "blog")
         (function org-hugo-new-subtree-post-capture-template))
        ))

;;;(after! org
  ;;;;; ⧗             ―               ﮸          λ ◁ ▷ ✧ ✦
