dotfiles/doom/config.org
* LIGATURES
Set custom ligature symbols for different modes, which prettifies the Emacs
experience.

Customizing ligatures, which replace strings with pretty symbols.  They configure by mode.

#+begin_src emacs-lisp :tangle ./config.el
;;;(after! org
  ;;;;; ⧗             ―               ﮸          λ ◁ ▷ ✧ ✦
  ;;;(appendq! +ligatures-extra-symbols
            ;;;`(:clock "⧗ "
              ;;;:circle ""
              ;;;:code ""
              ;;;:results "﮸"
              ;;;:shogi "⛊"
              ;;;:white_shogi "☖"
              ;;;:black_shogi "☗"
              ;;;:two_lines "⚏"
              ;;;;; :tags "    ‌"
              ;;;:empty ""
              ;;;))
  ;;;(set-ligatures! 'org-mode
    ;;;;; :merge t
    ;;;;; :clock ":LOGBOOK:"
    ;;;:quote              "#+begin_quote"
    ;;;:name               "#+CAPTION:"
    ;;;:quote_end          "#+end_quote"
    ;;;:code               "#+begin_src"
    ;;;:code               "#+BEGIN_SRC"
    ;;;:src_block          "#+BEGIN:"
    ;;;:code               "#+end_src"
    ;;;:code               "#+END_SRC"
    ;;;:results            "#+RESULTS:"
    ;;;:results            "#+results:"
    ;;;;; :src_block_end     ":END:"
    ;;;;; :src_block_end     "#+END"
    ;;;;; :two_lines   ":PROPERTIES:"
    ;;;;; :black_shogi   "#+CATEGORY:"
    ;;;;; :black_shogi   "#+category:"
    ;;;;; :two_lines   "#+startup:"
    ;;;;; :two_lines   "#+STARTUP:"
    ;;;:empty              "#+title: "
    ;;;:empty              "#+TITLE: "
    ;;;;; :shogi "#+NAME:"
    ;;;;; :shogi "#+name:"
    ;;;;; :tags "keywords:"
    ;;;;; :black_shogi "#+roam_tags:"
    ;;;))
#+end_src

* LINE SETTINGS
I set comment-line to 'SPC TAB TAB' which is a rather comfortable keybinding for
me.  The standard Emacs keybinding for comment-line is 'C-x C-;'.  The other
keybindings are for commands that toggle on/off line-related settings.
Doom Emacs uses 'SPC t' for "toggle" commands, so I choose 'SPC t' plus 'key'
for those bindings.

| COMMAND                  | DESCRIPTION                               | KEYBINDING  |
|--------------------------+-------------------------------------------+-------------|
| comment-line             | /Toggle commenting lines/                   | SPC TAB TAB |
| hl-line-mode             | /Toggle line highlighting in current frame/ | SPC t h     |
| global-hl-line-mode      | /Toggle line highlighting globally/         | SPC t H     |
| doom/toggle-line-numbers | /Toggle line numbers/                       | SPC t l     |
| toggle-truncate-lines    | /Toggle truncate lines/                     | SPC t t     |

#+begin_src emacs-lisp :tangle ./config.el
(setq display-line-numbers-type t)
(map! :leader
      :desc "Comment or uncomment lines" "TAB TAB" #'comment-line
      (:prefix ("t" . "toggle")
       :desc "Toggle line numbers" "l" #'doom/toggle-line-numbers
       :desc "Toggle line highlight in frame" "h" #'hl-line-mode
       :desc "Toggle line highlight globally" "H" #'global-hl-line-mode
       :desc "Toggle truncate lines" "t" #'toggle-truncate-lines))
#+end_src

These are my default line display preferences.

#+begin_src emacs-lisp :tangle ./config.el
(setq display-line-numbers-type `relative)
(global-visual-line-mode t)
#+end_src

* LOAD-MODES
These settings make it so company modes load by default on specific file formats.

#+begin_src emacs-lisp :tangle ./config.el
;; CONFIG
(require 'config-general-mode)
    (add-to-list 'auto-mode-alist '("\\.conf$" . config-general-mode))
#+end_src

* MODELINE
The modeline is the bottom status bar that appears in Emacs windows.  For more
information on what is available to configure in the Doom modeline, check out:
https://github.com/seagle0128/doom-modeline

#+begin_src emacs-lisp :tangle ./config.el
(setq all-the-icons-scale-factor .8) ;; fixes the issue of rightmost characters not fitting.
(set-face-attribute 'mode-line nil :font "Iosevka Nerd Font-15")
(setq doom-modeline-height 30     ;; sets modeline height
      doom-modeline-bar-width 5   ;; sets right bar width
      doom-modeline-persp-name t  ;; adds perspective name to modeline
      doom-modeline-persp-icon t) ;; adds folder icon next to persp name
#+end_src

* MOUSE SUPPORT
Adding mouse support in the terminal version of Emacs.

#+begin_src emacs-lisp :tangle ./config.el
(xterm-mouse-mode 1)
#+end_src

* OPEN SPECIFIC FILES
Keybindings to open files that I work with all the time using the find-file
command, which is the interactive file search that opens with 'C-x C-f' in GNU
Emacs or 'SPC f f' in Doom Emacs.  These keybindings use find-file
non-interactively since we specify exactly what file to open.  The format I use
for these bindings is 'SPC =' plus 'key' since Doom Emacs does not use 'SPC ='.

| PATH TO FILE                 | DESCRIPTION           | KEYBINDING |
|------------------------------+-----------------------+------------|
| ~/Documents/Notes/Agenda.org | /Edit agenda file/      | SPC = a    |
| ~/.config/doom/config.org    | /Edit doom config.org/  | SPC = c    |
| ~/.config/doom/init.el       | /Edit doom init.el/     | SPC = i    |
| ~/.config/doom/packages.el   | /Edit doom packages.el/ | SPC = p    |

#+begin_src emacs-lisp :tangle ./config.el
(map! :leader
      (:prefix ("=" . "open file")
       :desc "Edit agenda file" "a" #'(lambda () (interactive)
                                        (find-file
                                         "~/Documents/Notes/20220819130052-agenda.org"))
       :desc "Edit doom config.org" "c" #'(lambda () (interactive)
                                            (find-file
                                             "~/.config/doom/config.org"))
       :desc "Edit doom init.el" "i" #'(lambda () (interactive)
                                         (find-file "~/.config/doom/init.el"))
       :desc "Edit doom packages.el" "p" #'(lambda () (interactive)
                                             (find-file "~/.config/doom/packages.el"))))
#+end_src

* LSP
When configured properly lsp-mode's performance is on par with mainstream LSP
clients (e. g. VScode, Theia, etc).  Here are steps to achieve optimal results.

#+begin_src emacs-lisp :tangle ./config.el
(setq read-process-output-max (* 1024 1024)) ;; 1mb
(setq lsp-idle-delay 0.500)
(setq lsp-log-io nil) ; if set to true can cause a performance hit
;; c# LSP
(after! lsp-mode
    (setq lsp-csharp-server-path "/usr/bin/omnisharp"))
#+end_src

* ORG MODE
I wrapped most of this block in (after! org).  Without this, my settings might
evaluate too early, which will result in my settings being overwritten by Doom's
defaults.  I have also enabled org-journal, org-superstar and org-roam by adding
(+journal +pretty +roam2) to the org section of my Doom Emacs init.el.

These are my personal settings, heavily modified from DT's original config.  For
starters, I made it so org-agenda-files recursively feeds the agenda from .org
files found on my Notes directory, also made it so logs go into drawers, and
lastly customized the TODO keywords based on my personal preferences, these are
settings overwrite the original org settings, and this require to run after org,
so they can build upon the variables defined by the default configuration of
Doom Emacs.

#+begin_src emacs-lisp :tangle ./config.el
(after! org
  (setq org-directory "~/Documents/Notes/"
        org-agenda-files (directory-files-recursively
                          "~/Documents/Notes" "\\.org$")
        ;; org-default-notes-file (expand-file-name "Notes.org" org-directory)
        org-id-locations-file "~/Documents/Notes/.orgids"
        org-attach-id-dir "~/Documents/Notes/images"
        org-ellipsis " ▼ "
        org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")
        org-superstar-item-bullet-alist '((?+ . ?+) (?- . ?-))
        org-log-done 'time
        org-log-into-drawer t
        org-hide-emphasis-markers t
        org-todo-keywords
        '((sequence
           "TODO(t)" ; A task that needs doing & is ready to do
           "PROJ(p)" ; A project, which usually contains other tasks
           "ART(a)" ; Similar to PROJ but focused on drawing
           "IDEA(i)" ; Misc tasks, usually to elaborate on writing later
           "HOLD(h)" ; This task is paused/on hold because I'm a lazy fuck
           "|"
           "DONE(d)" ; Task succesfully completed
           "CANCELED(c)") ; Task was cancelled
          (sequence
           "[ ](T)" ; A task that needs doing
           "[-](S)" ; A task in progress
           "[?](H)" ; A task on hold
           "|"
           "[X](D)")) ;  A task completed
        org-todo-keyword-faces
        '(("[-]" . +org-todo-active)
          ("[?]" . +org-todo-onhold)
          ("HOLD" . +org-todo-onhold)
          ("ART" . +org-todo-project)
          ("IDEA" . +org-todo-project)
          ("PROJ" . +org-todo-project)
          ("CANCELED" . +org-todo-cancel)))
  (require 'org-habit))
#+end_src

** Set font sizes for each header level in Org
You can set the Org heading levels to be different font sizes.  So I choose to
have level 1 headings to be 140% in height, level 2 to be 130%, etc.  Other
interesting things you could play with include adding :foreground color and/or
:background color if you want to override the theme colors.

#+begin_src emacs-lisp :tangle ./config.el
(custom-set-faces
  '(org-level-1 ((t (:inherit outline-1 :height 1.4))))
  '(org-level-2 ((t (:inherit outline-2 :height 1.3))))
  '(org-level-3 ((t (:inherit outline-3 :height 1.2))))
  '(org-level-4 ((t (:inherit outline-4 :height 1.1))))
  '(org-level-5 ((t (:inherit outline-5 :height 1.0))))
  '(org-document-title ((t (:inherit outline-1 :height 2.0))))
)
#+end_src

** Org-Alert
This change makes it so org-alert uses libnotify for system notifications as
well as update intervals.

#+begin_src emacs-lisp :tangle ./config.el
;; (use-package org-alert
;;   :ensure t)
;; (setq alert-default-style 'libnotify
;;       org-alert-interval 3600)
;; ;; Auto start org-alert when emacs/daemon load
;; (org-alert-enable)
#+end_src

** Org-Auto-Tangle
Allows you to add the option #+auto_tangle: t in your Org file so that it
automatically tangles when you save the document.

#+begin_src emacs-lisp :tangle ./config.el
(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode))
#+end_src

