dotfiles/doom/config.el
  ;;;(appendq! +ligatures-extra-symbols
            ;;;`(:clock "⧗ "
              ;;;:circle ""
              ;;;:code ""
              ;;;:results "﮸"
              ;;;:shogi "⛊"
              ;;;:white_shogi "☖"
              ;;;:black_shogi "☗"
              ;;;:two_lines "⚏"
              ;;;;; :tags "    ‌"
              ;;;:empty ""
              ;;;))
  ;;;(set-ligatures! 'org-mode
    ;;;;; :merge t
    ;;;;; :clock ":LOGBOOK:"
    ;;;:quote              "#+begin_quote"
    ;;;:name               "#+CAPTION:"
    ;;;:quote_end          "#+end_quote"
    ;;;:code               "#+begin_src"
    ;;;:code               "#+BEGIN_SRC"
    ;;;:src_block          "#+BEGIN:"
    ;;;:code               "#+end_src"
    ;;;:code               "#+END_SRC"
    ;;;:results            "#+RESULTS:"
    ;;;:results            "#+results:"
    ;;;;; :src_block_end     ":END:"
    ;;;;; :src_block_end     "#+END"
    ;;;;; :two_lines   ":PROPERTIES:"
    ;;;;; :black_shogi   "#+CATEGORY:"
    ;;;;; :black_shogi   "#+category:"
    ;;;;; :two_lines   "#+startup:"
    ;;;;; :two_lines   "#+STARTUP:"
    ;;;:empty              "#+title: "
    ;;;:empty              "#+TITLE: "
    ;;;;; :shogi "#+NAME:"
    ;;;;; :shogi "#+name:"
    ;;;;; :tags "keywords:"
    ;;;;; :black_shogi "#+roam_tags:"
    ;;;))

(setq display-line-numbers-type t)
(map! :leader
      :desc "Comment or uncomment lines" "TAB TAB" #'comment-line
      (:prefix ("t" . "toggle")
       :desc "Toggle line numbers" "l" #'doom/toggle-line-numbers
       :desc "Toggle line highlight in frame" "h" #'hl-line-mode
       :desc "Toggle line highlight globally" "H" #'global-hl-line-mode
       :desc "Toggle truncate lines" "t" #'toggle-truncate-lines))

(setq display-line-numbers-type `relative)
(global-visual-line-mode t)

;; CONFIG
(require 'config-general-mode)
    (add-to-list 'auto-mode-alist '("\\.conf$" . config-general-mode))

(setq all-the-icons-scale-factor .8) ;; fixes the issue of rightmost characters not fitting.
(set-face-attribute 'mode-line nil :font "Iosevka Nerd Font-15")
(setq doom-modeline-height 30     ;; sets modeline height
      doom-modeline-bar-width 5   ;; sets right bar width
      doom-modeline-persp-name t  ;; adds perspective name to modeline
      doom-modeline-persp-icon t) ;; adds folder icon next to persp name

(xterm-mouse-mode 1)

(map! :leader
      (:prefix ("=" . "open file")
       :desc "Edit agenda file" "a" #'(lambda () (interactive)
                                        (find-file
                                         "~/Documents/Notes/20220819130052-agenda.org"))
       :desc "Edit doom config.org" "c" #'(lambda () (interactive)
                                            (find-file
                                             "~/.config/doom/config.org"))
       :desc "Edit doom init.el" "i" #'(lambda () (interactive)
                                         (find-file "~/.config/doom/init.el"))
       :desc "Edit doom packages.el" "p" #'(lambda () (interactive)
                                             (find-file "~/.config/doom/packages.el"))))

(setq read-process-output-max (* 1024 1024)) ;; 1mb
(setq lsp-idle-delay 0.500)
(setq lsp-log-io nil) ; if set to true can cause a performance hit
;; c# LSP
(after! lsp-mode
    (setq lsp-csharp-server-path "/usr/bin/omnisharp"))

(after! org
  (setq org-directory "~/Documents/Notes/"
        org-agenda-files (directory-files-recursively
                          "~/Documents/Notes" "\\.org$")
        ;; org-default-notes-file (expand-file-name "Notes.org" org-directory)
        org-id-locations-file "~/Documents/Notes/.orgids"
        org-attach-id-dir "~/Documents/Notes/images"
        org-ellipsis " ▼ "
        org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")
        org-superstar-item-bullet-alist '((?+ . ?+) (?- . ?-))
        org-log-done 'time
        org-log-into-drawer t
        org-hide-emphasis-markers t
        org-todo-keywords
        '((sequence
           "TODO(t)" ; A task that needs doing & is ready to do
           "PROJ(p)" ; A project, which usually contains other tasks
           "ART(a)" ; Similar to PROJ but focused on drawing
           "IDEA(i)" ; Misc tasks, usually to elaborate on writing later
           "HOLD(h)" ; This task is paused/on hold because I'm a lazy fuck
           "|"
           "DONE(d)" ; Task succesfully completed
           "CANCELED(c)") ; Task was cancelled
          (sequence
           "[ ](T)" ; A task that needs doing
           "[-](S)" ; A task in progress
           "[?](H)" ; A task on hold
           "|"
           "[X](D)")) ;  A task completed
        org-todo-keyword-faces
        '(("[-]" . +org-todo-active)
          ("[?]" . +org-todo-onhold)
          ("HOLD" . +org-todo-onhold)
          ("ART" . +org-todo-project)
          ("IDEA" . +org-todo-project)
          ("PROJ" . +org-todo-project)
          ("CANCELED" . +org-todo-cancel)))
  (require 'org-habit))

(custom-set-faces
  '(org-level-1 ((t (:inherit outline-1 :height 1.4))))
  '(org-level-2 ((t (:inherit outline-2 :height 1.3))))
  '(org-level-3 ((t (:inherit outline-3 :height 1.2))))
  '(org-level-4 ((t (:inherit outline-4 :height 1.1))))
  '(org-level-5 ((t (:inherit outline-5 :height 1.0))))
  '(org-document-title ((t (:inherit outline-1 :height 2.0))))
)

;; (use-package org-alert
;;   :ensure t)
;; (setq alert-default-style 'libnotify
;;       org-alert-interval 3600)
;; ;; Auto start org-alert when emacs/daemon load
;; (org-alert-enable)

(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode))

(map! :leader
