dotfiles/doom/config.el
      :desc "Org babel tangle" "m B" #'org-babel-tangle)
;; (org-babel-do-load-languages
;;  'org-babel-load-languages
;;  '((R . t)
;;    (emacs-lisp . t)
;;    (nix . t)))

(require 'org-inlinetask)
(setq org-inlinetask-min-level 9)

(setq deft-directory "~/Documents/Notes/")
(use-package org-roam
  :ensure t
  :custom
  (org-roam-directory "~/Documents/Notes/")
  (org-roam-completion-everywhere t)
  (org-roam-dailies-capture-templates
      '(("d" "default" entry "* %<%I:%M %p>: %?"
         :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
  (org-roam-capture-templates
   '(("d" "default" plain
      "%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)
     ("l" "programming language" plain
      (file "/home/jawz/.config/doom/templates/programming.org")
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+filetags: :programming:language:${title}:\n#+title: ${title}")
      :unnarrowed t)
     ("e" "political events" plain
      (file "/home/jawz/.config/doom/templates/events.org")
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+filetags: :politics:conflicts:\n#+title: ${title}")
      :unnarrowed t)
     ("p" "project" plain
      "* PROJ ${title}\n%?\n* Tasks"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+category: ${title}\n#+filetags: :project:\n#+title: ${title}")
      :unnarrowed t)
     ))
  :bind()
  :bind-keymap()
  :config
  (org-roam-db-autosync-mode))
(setq completion-ignore-case t)
(set-file-template! "~/Documents/Notes/.+\\.org$" 'org-mode :ignore t)

(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
    ;; :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start nil))

(use-package! org-transclusion
  :after org
  :init
  (map!
   :map global-map "<f12>" #'org-transclusion-add
   :leader
   (:prefix ("n r" . "toggle")
    :desc "Org Transclussion Add" "a" #'org-transclusion-add
    :desc "Org Transclusion Mode" "t" #'org-transclusion-mode)))

(after! undo-tree
  (setq undo-tree-auto-save-history nil))

;; (remove-hook 'undo-fu-mode-hook #'global-undo-fu-session-mode)

(setq user-full-name "Danilo Reyes"
      user-mail-address "CaptainJawZ@outlook.com")

(custom-set-variables
 '(flycheck-flake8-maximum-line-length 88)
 '(safe-local-variable-values '((git-commit-major-mode . git-commit-elisp-text-mode))))

(map! :leader
      (:prefix ("r" . "registers")
       :desc "Copy to register" "c" #'copy-to-register
       :desc "Frameset to register" "f" #'frameset-to-register
       :desc "Insert contents of register" "i" #'insert-register
       :desc "Jump to register" "j" #'jump-to-register
       :desc "List registers" "l" #'list-registers
       :desc "Number to register" "n" #'number-to-register
       :desc "Interactively choose a register" "r" #'counsel-register
       :desc "View a register" "v" #'view-register
       :desc "Window configuration to register" "w" #'window-configuration-to-register
       :desc "Increment register" "+" #'increment-register
       :desc "Point to register" "SPC" #'point-to-register))

(defadvice! fixed-flycheck-proselint-parse-errors-a (output checker buffer)
  :override #'flycheck-proselint-parse-errors
  (delq
   nil (mapcar (lambda (err)
                 (let-alist err
                   (and (or (not (derived-mode-p 'org-mode))
                            (save-excursion (goto-char .start)
                                            (not (org-in-src-block-p))))
                        (flycheck-error-new-at-pos
                         .start
                         (pcase .severity
                           (`"suggestion" 'info)
                           (`"warning"    'warning)
                           (`"error"      'error)
                           (_             'error))
                         .message
                         :id .check
                         :buffer buffer
                         :checker checker
                         :end-pos .end))))
               (let-alist (car (flycheck-parse-json output))
                 .data.errors))))

(defun prefer-horizontal-split ()
  (set-variable 'split-height-threshold nil t)
  (set-variable 'split-width-threshold 40 t)) ; make this as low as needed
(add-hook 'markdown-mode-hook 'prefer-horizontal-split)
(map! :leader
      :desc "Clone indirect buffer other window" "b c" #'clone-indirect-buffer-other-window)

(setq twittering-allow-insecure-server-cert t)

(map! :leader
      (:prefix ("w" . "window")
