dotfiles/doom/config.org
* WINNER MODE
Winner mode comes with GNU Emacs since version 20.  This is a global minor mode
and, when activated, it allows you to “undo” (and “redo”) changes in the window
configuration with the key commands 'SCP w <left>' and 'SPC w <right>'.

#+begin_src emacs-lisp :tangle ./config.el
(map! :leader
      (:prefix ("w" . "window")
       :desc "Winner redo" "<right>" #'winner-redo
       :desc "Winner undo" "<left>" #'winner-undo))
#+end_src

* ZAP TO CHAR
Emacs provides a 'zap-to-char' command that kills from the current point to a
character.  It bounds to 'M-z' in standard GNU Emacs but since Doom Emacs uses
'SPC' as its leader key and does not have 'SPC z' binding to anything, it just
makes since to use it for 'zap-to-char'.  Note that 'zap-to-char' can combine
with the universal argument 'SPC u' to modify its behaviour.  Examples of
'zap-to-char' usage listed in the table below:

| KEYBINDING                | WHAT IS DOES                                               |
|---------------------------+------------------------------------------------------------|
| SPC z e                   | deletes all chars to the next occurrence of 'e'            |
| SPC u 2 SPC z e           | deletes all chars to the second occurrence of 'e'          |
| SPC u - SPC z e           | deletes all chars to the previous occurrence of 'e'        |
| SPC u -2 SPC z e          | deletes all chars to the fourth previous occurrence of 'e' |
| SPC u 1 0 0 SPC u SPC z e | deletes all chars to the 100th occurrence of 'e'           |

=TIP= The universal argument (SPC u) can only take a single integer by default.
If you need to use a multi-digit number (like 100 in the last example in the
table above), then you must terminate the universal argument with another 'SPC
u' after typing the number.

'zap-up-to-char' is an alternative command that does not zap the char specified.
It bounds to 'SPC Z'.  It can also combine in conjunction with the universal
argument 'SPC u' in similar fashion to the 'zap-to-char' examples above.

=NOTE= Vim (evil mode) has similar functionality builtin.  You can delete to
the next occurrence of 'e' by using 'dte' in normal.  To delete to the next
occurrence of 'e' including the 'e', then you would use 'dfe'.  And you can
modify 'dt' and 'df' by prefixing them with numbers, so '2dte' would delete to
the second occurrence of 'e'.

#+begin_src emacs-lisp :tangle ./config.el
(map! :leader
      :desc "Zap to char" "z" #'zap-to-char
      :desc "Zap up to char" "Z" #'zap-up-to-char)
#+end_src

#  LocalWords:  ibuffer dired elisp setq modeline libnotify Proselint DT's SPC
#  LocalWords:  GitLab unmark emacsclient modeline Goto emms eww Transclusion
#  LocalWords:  Inlinetask LSP
